{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_1/lstm_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/flatten_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "76"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/functional_1/lstm_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/functional_1/lstm_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/Cast", "op": "Cast", "input": ["inputs"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/functional_1/embedding_1/Cast", "StatefulPartitionedCall/functional_1/embedding_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/embedding_1/Cast", "StatefulPartitionedCall/functional_1/embedding_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_1/embedding_1/Less", "StatefulPartitionedCall/functional_1/embedding_1/add", "StatefulPartitionedCall/functional_1/embedding_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_1/embedding_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_1/embedding_1/SelectV2", "StatefulPartitionedCall/functional_1/embedding_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_1/embedding_1/GatherV2", "StatefulPartitionedCall/functional_1/lstm_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_1/embedding_1/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/functional_1/lstm_1/transpose", "StatefulPartitionedCall/functional_1/lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/lstm_1/Shape", "StatefulPartitionedCall/functional_1/lstm_1/strided_slice/stack", "StatefulPartitionedCall/functional_1/lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_1/lstm_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/functional_1/lstm_1/strided_slice", "StatefulPartitionedCall/functional_1/lstm_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/functional_1/lstm_1/strided_slice", "StatefulPartitionedCall/functional_1/lstm_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/functional_1/lstm_1/zeros/packed", "StatefulPartitionedCall/functional_1/lstm_1/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/functional_1/lstm_1/zeros_1/packed", "StatefulPartitionedCall/functional_1/lstm_1/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/LoopControlInputs/_21", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_1/lstm_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/functional_1/lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/functional_1/lstm_1/zeros", "^StatefulPartitionedCall/functional_1/lstm_1/zeros_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/enter/_14", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1/lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/functional_1/lstm_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/enter/_17", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1/lstm_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/functional_1/lstm_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/enter/_12", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1/lstm_1/Max", "^StatefulPartitionedCall/functional_1/lstm_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/enter/_11", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/loop_counter", "^StatefulPartitionedCall/functional_1/lstm_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/enter/_15", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1/lstm_1/zeros", "^StatefulPartitionedCall/functional_1/lstm_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/enter/_16", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1/lstm_1/zeros_1", "^StatefulPartitionedCall/functional_1/lstm_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/enter/_13", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1/lstm_1/time", "^StatefulPartitionedCall/functional_1/lstm_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/enter/_18", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/functional_1/lstm_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2xzdG1fMS93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/enter/_19", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/functional_1/lstm_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2xzdG1fMS93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/enter/_20", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_4", "^StatefulPartitionedCall/functional_1/lstm_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xL2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/merge/_25", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/enter/_14", "StatefulPartitionedCall/functional_1/lstm_1/while/next_iteration/_49"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/merge/_28", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/enter/_17", "StatefulPartitionedCall/functional_1/lstm_1/while/next_iteration/_52"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/merge/_23", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/enter/_12", "StatefulPartitionedCall/functional_1/lstm_1/while/next_iteration/_47"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/merge/_22", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/enter/_11", "StatefulPartitionedCall/functional_1/lstm_1/while/next_iteration/_46"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/merge/_26", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/enter/_15", "StatefulPartitionedCall/functional_1/lstm_1/while/next_iteration/_50"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/merge/_27", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/enter/_16", "StatefulPartitionedCall/functional_1/lstm_1/while/next_iteration/_51"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/merge/_24", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/enter/_13", "StatefulPartitionedCall/functional_1/lstm_1/while/next_iteration/_48"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/functional_1/lstm_1/while/cond/_9/input_control_node/_53", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_1/lstm_1/while/enter/_18", "^StatefulPartitionedCall/functional_1/lstm_1/while/enter/_19", "^StatefulPartitionedCall/functional_1/lstm_1/while/enter/_20", "^StatefulPartitionedCall/functional_1/lstm_1/while/merge/_22", "^StatefulPartitionedCall/functional_1/lstm_1/while/merge/_23", "^StatefulPartitionedCall/functional_1/lstm_1/while/merge/_24", "^StatefulPartitionedCall/functional_1/lstm_1/while/merge/_25", "^StatefulPartitionedCall/functional_1/lstm_1/while/merge/_26", "^StatefulPartitionedCall/functional_1/lstm_1/while/merge/_27", "^StatefulPartitionedCall/functional_1/lstm_1/while/merge/_28"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/cond/_9/functional_1/lstm_1/while/Less_1", "op": "Less", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/merge/_22", "StatefulPartitionedCall/functional_1/lstm_1/while/merge/_23", "^Func/StatefulPartitionedCall/functional_1/lstm_1/while/cond/_9/input_control_node/_53"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/cond/_9/functional_1/lstm_1/while/Less/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_1/lstm_1/while/cond/_9/input_control_node/_53"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/cond/_9/functional_1/lstm_1/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/merge/_24", "StatefulPartitionedCall/functional_1/lstm_1/while/cond/_9/functional_1/lstm_1/while/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/cond/_9/functional_1/lstm_1/while/LogicalAnd", "op": "LogicalAnd", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/cond/_9/functional_1/lstm_1/while/Less_1", "StatefulPartitionedCall/functional_1/lstm_1/while/cond/_9/functional_1/lstm_1/while/Less"]}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/LoopCond/_29", "op": "LoopCond", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/cond/_9/functional_1/lstm_1/while/LogicalAnd"]}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/Max_switch/_31", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/merge/_23", "StatefulPartitionedCall/functional_1/lstm_1/while/LoopCond/_29"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/while/loop_counter_switch/_30", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/merge/_22", "StatefulPartitionedCall/functional_1/lstm_1/while/LoopCond/_29"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/zeros_1_switch/_35", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/merge/_27", "StatefulPartitionedCall/functional_1/lstm_1/while/LoopCond/_29"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_36", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/merge/_28", "StatefulPartitionedCall/functional_1/lstm_1/while/LoopCond/_29"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/time_switch/_32", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/merge/_24", "StatefulPartitionedCall/functional_1/lstm_1/while/LoopCond/_29"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/zeros_switch/_34", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/merge/_26", "StatefulPartitionedCall/functional_1/lstm_1/while/LoopCond/_29"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/TensorArrayV2_1_switch/_33", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/merge/_25", "StatefulPartitionedCall/functional_1/lstm_1/while/LoopCond/_29"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/exit/_39", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/Max_switch/_31"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/exit/_38", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/while/loop_counter_switch/_30"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/loop_body_control/_37", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/while/loop_counter_switch/_30:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/exit/_43", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/zeros_1_switch/_35"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/exit/_44", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_36"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/exit/_40", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/time_switch/_32"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/exit/_42", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/zeros_switch/_34"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/exit/_41", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/TensorArrayV2_1_switch/_33"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/input_control_node/_65", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/Max_switch/_31", "^StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_36", "^StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/TensorArrayV2_1_switch/_33", "^StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/time_switch/_32", "^StatefulPartitionedCall/functional_1/lstm_1/while/loop_body_control/_37", "^StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/zeros_1_switch/_35", "^StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/zeros_switch/_34", "^StatefulPartitionedCall/functional_1/lstm_1/while/enter/_18", "^StatefulPartitionedCall/functional_1/lstm_1/while/enter/_19", "^StatefulPartitionedCall/functional_1/lstm_1/while/enter/_20"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/exit/_41", "StatefulPartitionedCall/functional_1/lstm_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "3"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/input_control_node/_65"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/split/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/input_control_node/_65"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/input_control_node/_65"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/input/_68", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/time_switch/_32:1", "^Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/input_control_node/_65"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/input_control_node/_65"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Cast/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/functional_1/lstm_1/while/enter/_18", "^Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/input_control_node/_65"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/functional_1/lstm_1/while/enter/_19", "^Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/input_control_node/_65"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/add_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/functional_1/lstm_1/while/enter/_20", "^Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/input_control_node/_65"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_1/lstm_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/functional_1/lstm_1/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/while/loop_counter_switch/_30:1", "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/add", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/input/_68", "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_36:1", "Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/input/_68", "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/zeros_switch/_34:1", "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/output_control_node/_86", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/add_1/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/add_1/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/lstm_1/transpose_1", "StatefulPartitionedCall/functional_1/flatten_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/add_1/ReadVariableOp", "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/next_iteration/_52", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_36:1", "^Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/output_control_node/_86", "^Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/input_control_node/_65"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/next_iteration/_47", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/Max_switch/_31:1", "^Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/output_control_node/_86", "^StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/NoOp", "^Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/input_control_node/_65"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/next_iteration/_46", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/add_1", "^Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/output_control_node/_86", "^StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/next_iteration/_48", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/add", "^Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/output_control_node/_86", "^StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/flatten_1/Reshape", "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/add_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/add"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_1/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/split", "op": "Split", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/split/split_dim", "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/add_1"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1/dense_1/Softmax", "^StatefulPartitionedCall/functional_1/lstm_1/while/exit/_44", "^StatefulPartitionedCall/functional_1/lstm_1/while/exit/_42", "^StatefulPartitionedCall/functional_1/lstm_1/while/exit/_38", "^StatefulPartitionedCall/functional_1/lstm_1/while/exit/_39", "^StatefulPartitionedCall/functional_1/lstm_1/while/exit/_43", "^StatefulPartitionedCall/functional_1/lstm_1/while/exit/_40", "^StatefulPartitionedCall/functional_1/lstm_1/while/exit/_41"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Sigmoid_1", "StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/zeros_1_switch/_35:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Sigmoid", "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/mul", "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/next_iteration/_51", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/add_2", "^Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/output_control_node/_86", "^StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Sigmoid_2", "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/StatefulPartitionedCall/functional_1/lstm_1/TensorArrayV2_1_switch/_33:1", "Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/input/_68", "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/mul_2"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "resize_if_index_out_of_bounds": {"b": false}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/next_iteration/_50", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/mul_2", "^Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/output_control_node/_86", "^StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/next_iteration/_49", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/TensorArrayV2Write/TensorListSetItem", "^Func/StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/output_control_node/_86", "^StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_1/lstm_1/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/transpose_1/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/flatten_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp", "shape": [30, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/Max", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/time", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_2", "shape": [10, 40], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_3", "shape": [10, 40], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_4", "shape": [40], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/TensorArrayV2_1/num_elements", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/GatherV2/ReadVariableOp", "shape": [76, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/zeros_1/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/zeros_1/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/cond/_9/functional_1/lstm_1/while/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/add_1/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/add/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Cast/ReadVariableOp", "shape": [10, 40], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "shape": [10, 40], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/lstm_1/while/body/_10/functional_1/lstm_1/while/lstm_cell_1/add_1/ReadVariableOp", "shape": [40], "dtype": "float32"}]}]}