{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_10": {"name": "keras_tensor_10:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_2_1/embedding_2_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "197"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/embedding_2_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/embedding_2_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/embedding_2_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/global_average_pooling1d_2_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/dense_4_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/dense_4_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/dense_5_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/dense_5_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_10", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "4"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/embedding_2_1/Cast", "op": "Cast", "input": ["keras_tensor_10"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/embedding_2_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/functional_2_1/embedding_2_1/Cast", "StatefulPartitionedCall/functional_2_1/embedding_2_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/embedding_2_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/embedding_2_1/Cast", "StatefulPartitionedCall/functional_2_1/embedding_2_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/embedding_2_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_2_1/embedding_2_1/Less", "StatefulPartitionedCall/functional_2_1/embedding_2_1/add", "StatefulPartitionedCall/functional_2_1/embedding_2_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/embedding_2_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_2_1/embedding_2_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_2_1/embedding_2_1/SelectV2", "StatefulPartitionedCall/functional_2_1/embedding_2_1/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_2_1/global_average_pooling1d_2_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/functional_2_1/embedding_2_1/GatherV2", "StatefulPartitionedCall/functional_2_1/global_average_pooling1d_2_1/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/dense_4_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_2_1/global_average_pooling1d_2_1/Mean", "StatefulPartitionedCall/functional_2_1/dense_4_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_2_1/dense_4_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/dense_5_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_2_1/dense_4_1/Relu", "StatefulPartitionedCall/functional_2_1/dense_5_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_2_1/dense_5_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/dense_5_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_2_1/dense_5_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_2_1/dense_5_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_2_1/embedding_2_1/GatherV2/ReadVariableOp", "shape": [197, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/embedding_2_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_2_1/embedding_2_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_2_1/embedding_2_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_2_1/global_average_pooling1d_2_1/Mean/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_2_1/dense_4_1/Cast/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/dense_4_1/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/dense_5_1/Cast/ReadVariableOp", "shape": [16, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/dense_5_1/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}]}]}